

*** installation package biblatex

[2015-10-07 Wed 16:59]


 tlmgr install latex
    
which tlmgr
/usr/local/texlive/2015/bin/x86_64-linux/tlmgr

su

umask 022

/usr/local/texlive/2014/bin/x86_64-linux/tlmgr 
/usr/local/texlive/2015/bin/x86_64-linux/tlmgr

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info biblatex
/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install biblatex


results in minibuffer

#+HEADERS: :results silent

#+HEADERS: :results raw
#+BEGIN_SRC sh

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info biblatex

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     biblatex
category:    Package
shortdesc:   Bibliographies in LaTeX using BibTeX for sorting only.
longdesc:    Biblatex is a complete reimplementation of the bibliographic facilities provided by LaTeX in conjunction with BibTeX. It redesigns the way in which LaTeX interacts with BibTeX at a fairly fundamental level. With biblatex, BibTeX is only used (if it is used at all) to sort the bibliography and to generate labels. Formatting of the bibliography is entirely controlled by TeX macros (the BibTeX-based mechanism embeds some parts of formatting in the BibTeX style file. Good working knowledge in LaTeX should be sufficient to design new bibliography and citation styles; nothing related to BibTeX's language is needed. In fact, users need not remain bound to BibTeX for use with biblatex: an alternative bibliography processor biblatex- biber is available. Development of biblatex and biblatex-biber is closely coupled; the present release of biblatex is designed to work with biblatex-biber version 0.9.6. The package needs e- TeX, and uses the author's etoolbox and logreq packages. For users of biblatex-biber, version 0.9 is required (at least; refer to the notes for the version of biblatex-biber that you are using). Apart from the features unique to biblatex, the package also incorporates core features of the following packages: babelbib, bibtopic, bibunits, chapterbib, cite, inlinebib, mcite and mciteplus, mlbib, multibib, splitbib. Biblatex supports split bibliographies and multiple bibliographies within one document, and separate lists of bibliographic shorthands. Bibliographies may be subdivided into parts (by chapter, by section, etc.) and/or segmented by topics (by type, by keyword, etc.). Biblatex is fully localized and can interface with the babel.
installed:   No
sizes:       doc: 18441k, run: 2129k
relocatable: Yes
cat-version: 3.0
cat-date:    2015-04-26 09:52:59 +0200
cat-license: lppl
collection:  collection-bibtexextra





#+HEADERS: :results raw
#+HEADERS: :dir /sudo::/tmp
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install biblatex

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
[1/1, ??:??/??:??] install: biblatex [168k]
tlmgr: package log updated: /usr/local/texlive/2015/texmf-var/web2c/tlmgr.log
running mktexlsr ...
done running mktexlsr.


***  etoolbox.sty


#+HEADERS: :results raw
#+BEGIN_SRC sh

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info etoolbox

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     etoolbox
category:    Package
shortdesc:   e-TeX tools for LaTeX
longdesc:    The package is a toolbox of programming facilities geared primarily towards LaTeX class and package authors. It provides LaTeX frontends to some of the new primitives provided by e-TeX as well as some generic tools which are not strictly related to e-TeX but match the profile of this package. Note that the initial versions of this package were released under the name elatex. The package provides functions that seem to offer alternative ways of implementing some LaTeX kernel commands; nevertheless, the package will not modify any part of the LaTeX kernel.
installed:   Yes
revision:    38031
sizes:       run: 49k
relocatable: No
cat-version: 2.2a
cat-date:    2015-08-03 06:47:20 +0200
cat-license: lppl1.3
cat-topics:  macro-supp
collection:  collection-latexextra

tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     etoolbox
category:    Package
shortdesc:   e-TeX tools for LaTeX
longdesc:    The package is a toolbox of programming facilities geared primarily towards LaTeX class and package authors. It provides LaTeX frontends to some of the new primitives provided by e-TeX as well as some generic tools which are not strictly related to e-TeX but match the profile of this package. Note that the initial versions of this package were released under the name elatex. The package provides functions that seem to offer alternative ways of implementing some LaTeX kernel commands; nevertheless, the package will not modify any part of the LaTeX kernel.
installed:   No
sizes:       doc: 297k, run: 49k
relocatable: Yes
cat-version: 2.2a
cat-date:    2015-08-03 06:47:20 +0200
cat-license: lppl1.3
cat-topics:  macro-supp
collection:  collection-latexextra



#+HEADERS: :results raw
#+HEADERS: :dir /sudo::/tmp
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install etoolbox

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
[1/1, ??:??/??:??] install: etoolbox [8k]
tlmgr: package log updated: /usr/local/texlive/2015/texmf-var/web2c/tlmgr.log
running mktexlsr ...
done running mktexlsr.




***  logreq.sty


#+HEADERS: :results raw
#+BEGIN_SRC sh

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info logreq

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     logreq
category:    Package
shortdesc:   Support for automation of the LaTeX workflow.
longdesc:    The package helps to automate a typical LaTeX workflow that involves running LaTeX several times, running tools such as BibTeX or makeindex, and so on. It will log requests like "please rerun LaTeX" or "please run BibTeX on file X" to an external XML file which lists all open tasks in a machine- readable format. Compiler scripts and integrated LaTeX editing environments may parse this file to determine the next steps in the workflow in a way that is more efficient than parsing the main log file. In sum, the package will do two things: enable package authors to use LaTeX commands to issue requests, collect all requests from all packages and write them to an external XML file at the end of the document.
installed:   Yes
revision:    19640
sizes:       run: 13k
relocatable: No
cat-version: 1.0
cat-date:    2014-10-17 21:54:02 +0200
cat-license: lppl1.3
collection:  collection-bibtexextra

tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     logreq
category:    Package
shortdesc:   Support for automation of the LaTeX workflow.
longdesc:    The package helps to automate a typical LaTeX workflow that involves running LaTeX several times, running tools such as BibTeX or makeindex, and so on. It will log requests like "please rerun LaTeX" or "please run BibTeX on file X" to an external XML file which lists all open tasks in a machine- readable format. Compiler scripts and integrated LaTeX editing environments may parse this file to determine the next steps in the workflow in a way that is more efficient than parsing the main log file. In sum, the package will do two things: enable package authors to use LaTeX commands to issue requests, collect all requests from all packages and write them to an external XML file at the end of the document.
installed:   No
sizes:       doc: 49k, run: 13k
relocatable: Yes
cat-version: 1.0
cat-date:    2014-10-17 21:54:02 +0200
cat-license: lppl1.3
collection:  collection-bibtexextra


#+HEADERS: :results raw
#+HEADERS: :dir /sudo::/tmp
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install logreq

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
[1/1, ??:??/??:??] install: logreq [4k]
tlmgr: package log updated: /usr/local/texlive/2015/texmf-var/web2c/tlmgr.log
running mktexlsr ...
done running mktexlsr.
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
[1/1, ??:??/??:??] install: etoolbox [8k]
tlmgr: package log updated: /usr/local/texlive/2015/texmf-var/web2c/tlmgr.log
running mktexlsr ...
done running mktexlsr.


***  url.sty


#+HEADERS: :results raw
#+BEGIN_SRC sh

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info url

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     url
category:    Package
shortdesc:   Verbatim with URL-sensitive line breaks.
longdesc:    The command \url is a form of verbatim command that allows linebreaks at certain characters or combinations of characters, accepts reconfiguration, and can usually be used in the argument to another command. (The \urldef command provides robust commands that serve in cases when \url doesn't work in an argument.) The command is intended for email addresses, hypertext links, directories/paths, etc., which normally have no spaces, so by default the package ignores spaces in its argument. However, a package option "allows spaces", which is useful for operating systems where spaces are a common part of file names.
installed:   Yes
revision:    32528
sizes:       run: 17k
relocatable: No
cat-version: 3.4
cat-date:    2013-12-31 15:02:54 +0100
cat-license: lppl
collection:  collection-latex

tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     url
category:    Package
shortdesc:   Verbatim with URL-sensitive line breaks.
longdesc:    The command \url is a form of verbatim command that allows linebreaks at certain characters or combinations of characters, accepts reconfiguration, and can usually be used in the argument to another command. (The \urldef command provides robust commands that serve in cases when \url doesn't work in an argument.) The command is intended for email addresses, hypertext links, directories/paths, etc., which normally have no spaces, so by default the package ignores spaces in its argument. However, a package option "allows spaces", which is useful for operating systems where spaces are a common part of file names.
installed:   No
sizes:       doc: 277k, run: 17k
relocatable: Yes
cat-version: 3.4
cat-date:    2013-12-31 15:02:54 +0100
cat-license: lppl
collection:  collection-latex



#+HEADERS: :results raw
#+HEADERS: :dir /sudo::/tmp
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install url

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
[1/1, ??:??/??:??] install: url [6k]
tlmgr: package log updated: /usr/local/texlive/2015/texmf-var/web2c/tlmgr.log
running mktexlsr ...
done running mktexlsr.



***  url.sty


#+HEADERS: :results raw
#+BEGIN_SRC sh

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr info biber

#+END_SRC

#+RESULTS:
tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     biber
category:    Package
shortdesc:   A BibTeX replacement for users of biblatex.
longdesc:    Biber is a BibTeX replacement for users of biblatex. Biber supports full UTF-8, can (re)-encode input and output, supports highly configurable sorting, dynamic bibliography sets and many other features. The CTAN distribution offers a compressed tar archive of the sources, etc., together with "binary" distributions for a variety of platforms. Note: on SourceForge biber is formally named "biblatex-biber", to distinguish it from an earlier (now apparently moribund) project called "biber".
installed:   Yes
revision:    37851
sizes:       bin: 19301k
relocatable: No
cat-version: 2.1
cat-date:    2015-05-08 00:12:35 +0200
cat-license: artistic
cat-topics:  biblio
cat-related: bibtex crosstex biblatex
collection:  collection-bibtexextra

Unable to download the remote TeX Live database,
but found a local copy so using that.

You may want to try specifying an explicit or different CTAN mirror;
see the information and examples for the -repository option at
http://tug.org/texlive/doc/install-tl.html
(or in the output of install-tl --help).

tlmgr: package repository ftp://ftp.ccu.edu.tw/pub/tex/systems/texlive/tlnet
package:     biber
category:    Package
shortdesc:   A BibTeX replacement for users of biblatex.
longdesc:    Biber is a BibTeX replacement for users of biblatex. Biber supports full UTF-8, can (re)-encode input and output, supports highly configurable sorting, dynamic bibliography sets and many other features. The CTAN distribution offers a compressed tar archive of the sources, etc., together with "binary" distributions for a variety of platforms. Note: on SourceForge biber is formally named "biblatex-biber", to distinguish it from an earlier (now apparently moribund) project called "biber".
installed:   No
sizes:       src: 2173k, doc: 337k, bin: 19301k
relocatable: No
cat-version: 2.1
cat-date:    2015-05-08 00:12:35 +0200
cat-license: artistic
cat-topics:  biblio
cat-related: bibtex crosstex biblatex
collection:  collection-bibtexextra

proxychains -f /home/c5766/.proxychains/proxychains.conf \
/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install biber



#+HEADERS: :results raw
#+HEADERS: :dir /sudo::/tmp
#+BEGIN_SRC sh

umask 022

/usr/local/texlive/2015/bin/x86_64-linux/tlmgr install biber

#+END_SRC





